Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.81/edc/PIC32MZ2064DAK169.PIC
      <edc:SFRDef edc:_addr="0x1F860750" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="8" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNPUH" edc:desc="" edc:grp="PORTH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CNPUH" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTH">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPUH0" edc:desc="" edc:mask="0x1" edc:name="CNPUH0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUH1" edc:desc="" edc:mask="0x1" edc:name="CNPUH1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUH2" edc:desc="" edc:mask="0x1" edc:name="CNPUH2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUH3" edc:desc="" edc:mask="0x1" edc:name="CNPUH3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUH4" edc:desc="" edc:mask="0x1" edc:name="CNPUH4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUH5" edc:desc="" edc:mask="0x1" edc:name="CNPUH5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUH6" edc:desc="" edc:mask="0x1" edc:name="CNPUH6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUH7" edc:desc="" edc:mask="0x1" edc:name="CNPUH7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUH8" edc:desc="" edc:mask="0x1" edc:name="CNPUH8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUH9" edc:desc="" edc:mask="0x1" edc:name="CNPUH9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUH10" edc:desc="" edc:mask="0x1" edc:name="CNPUH10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUH11" edc:desc="" edc:mask="0x1" edc:name="CNPUH11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUH12" edc:desc="" edc:mask="0x1" edc:name="CNPUH12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUH13" edc:desc="" edc:mask="0x1" edc:name="CNPUH13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUH14" edc:desc="" edc:mask="0x1" edc:name="CNPUH14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUH15" edc:desc="" edc:mask="0x1" edc:name="CNPUH15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860760" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="8" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNPDH" edc:desc="" edc:grp="PORTH" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CNPDH" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTH">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPDH0" edc:desc="" edc:mask="0x1" edc:name="CNPDH0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDH1" edc:desc="" edc:mask="0x1" edc:name="CNPDH1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDH2" edc:desc="" edc:mask="0x1" edc:name="CNPDH2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDH3" edc:desc="" edc:mask="0x1" edc:name="CNPDH3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDH4" edc:desc="" edc:mask="0x1" edc:name="CNPDH4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDH5" edc:desc="" edc:mask="0x1" edc:name="CNPDH5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDH6" edc:desc="" edc:mask="0x1" edc:name="CNPDH6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDH7" edc:desc="" edc:mask="0x1" edc:name="CNPDH7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDH8" edc:desc="" edc:mask="0x1" edc:name="CNPDH8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDH9" edc:desc="" edc:mask="0x1" edc:name="CNPDH9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDH10" edc:desc="" edc:mask="0x1" edc:name="CNPDH10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDH11" edc:desc="" edc:mask="0x1" edc:name="CNPDH11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDH12" edc:desc="" edc:mask="0x1" edc:name="CNPDH12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDH13" edc:desc="" edc:mask="0x1" edc:name="CNPDH13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDH14" edc:desc="" edc:mask="0x1" edc:name="CNPDH14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDH15" edc:desc="" edc:mask="0x1" edc:name="CNPDH15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860770" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="8" edc:access="----------------n---n-----------" edc:cname="CNCONH" edc:desc="" edc:grp="PORTH" edc:impl="0xffff9fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0---0-----------" edc:name="CNCONH" edc:nzwidth="0x20" edc:por="----------------0---0-----------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTH">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0xb"/>
            <edc:SFRFieldDef edc:cname="EDGEDETECT" edc:mask="0x1" edc:name="EDGEDETECT" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CHANGE NOTICE H" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860780" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="8" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="CNENH" edc:desc="" edc:grp="PORTH" edc:impl="0xffc0ffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="CNENH" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTH">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNIEH0" edc:desc="" edc:mask="0x1" edc:name="CNIEH0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEH1" edc:desc="" edc:mask="0x1" edc:name="CNIEH1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEH2" edc:desc="" edc:mask="0x1" edc:name="CNIEH2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEH3" edc:desc="" edc:mask="0x1" edc:name="CNIEH3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEH4" edc:desc="" edc:mask="0x1" edc:name="CNIEH4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEH5" edc:desc="" edc:mask="0x1" edc:name="CNIEH5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEH6" edc:desc="" edc:mask="0x1" edc:name="CNIEH6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEH7" edc:desc="" edc:mask="0x1" edc:name="CNIEH7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEH8" edc:desc="" edc:mask="0x1" edc:name="CNIEH8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEH9" edc:desc="" edc:mask="0x1" edc:name="CNIEH9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEH10" edc:desc="" edc:mask="0x1" edc:name="CNIEH10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEH11" edc:desc="" edc:mask="0x1" edc:name="CNIEH11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEH12" edc:desc="" edc:mask="0x1" edc:name="CNIEH12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEH13" edc:desc="" edc:mask="0x1" edc:name="CNIEH13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEH14" edc:desc="" edc:mask="0x1" edc:name="CNIEH14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEH15" edc:desc="" edc:mask="0x1" edc:name="CNIEH15" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
