Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.81/edc/PIC32MZ2064DAK169.PIC
      <edc:SFRDef edc:_addr="0x1F8EA988" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA98" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA98" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL2423" edc:desc="" edc:mask="0xf" edc:name="PIXEL2423" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2422" edc:desc="" edc:mask="0xf" edc:name="PIXEL2422" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2421" edc:desc="" edc:mask="0xf" edc:name="PIXEL2421" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2420" edc:desc="" edc:mask="0xf" edc:name="PIXEL2420" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2419" edc:desc="" edc:mask="0xf" edc:name="PIXEL2419" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2418" edc:desc="" edc:mask="0xf" edc:name="PIXEL2418" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2417" edc:desc="" edc:mask="0xf" edc:name="PIXEL2417" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2416" edc:desc="" edc:mask="0xf" edc:name="PIXEL2416" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA98C" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA99" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA99" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL2431" edc:desc="" edc:mask="0xf" edc:name="PIXEL2431" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2430" edc:desc="" edc:mask="0xf" edc:name="PIXEL2430" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2429" edc:desc="" edc:mask="0xf" edc:name="PIXEL2429" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2428" edc:desc="" edc:mask="0xf" edc:name="PIXEL2428" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2427" edc:desc="" edc:mask="0xf" edc:name="PIXEL2427" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2426" edc:desc="" edc:mask="0xf" edc:name="PIXEL2426" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2425" edc:desc="" edc:mask="0xf" edc:name="PIXEL2425" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2424" edc:desc="" edc:mask="0xf" edc:name="PIXEL2424" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA990" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA100" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA100" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL257" edc:desc="" edc:mask="0xf" edc:name="PIXEL257" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL256" edc:desc="" edc:mask="0xf" edc:name="PIXEL256" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL255" edc:desc="" edc:mask="0xf" edc:name="PIXEL255" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL254" edc:desc="" edc:mask="0xf" edc:name="PIXEL254" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL253" edc:desc="" edc:mask="0xf" edc:name="PIXEL253" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL252" edc:desc="" edc:mask="0xf" edc:name="PIXEL252" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL251" edc:desc="" edc:mask="0xf" edc:name="PIXEL251" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL250" edc:desc="" edc:mask="0xf" edc:name="PIXEL250" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA994" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA101" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA101" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL2515" edc:desc="" edc:mask="0xf" edc:name="PIXEL2515" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2514" edc:desc="" edc:mask="0xf" edc:name="PIXEL2514" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2513" edc:desc="" edc:mask="0xf" edc:name="PIXEL2513" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2512" edc:desc="" edc:mask="0xf" edc:name="PIXEL2512" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2511" edc:desc="" edc:mask="0xf" edc:name="PIXEL2511" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2510" edc:desc="" edc:mask="0xf" edc:name="PIXEL2510" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL259" edc:desc="" edc:mask="0xf" edc:name="PIXEL259" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL258" edc:desc="" edc:mask="0xf" edc:name="PIXEL258" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA998" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA102" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA102" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL2523" edc:desc="" edc:mask="0xf" edc:name="PIXEL2523" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2522" edc:desc="" edc:mask="0xf" edc:name="PIXEL2522" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2521" edc:desc="" edc:mask="0xf" edc:name="PIXEL2521" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2520" edc:desc="" edc:mask="0xf" edc:name="PIXEL2520" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2519" edc:desc="" edc:mask="0xf" edc:name="PIXEL2519" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2518" edc:desc="" edc:mask="0xf" edc:name="PIXEL2518" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2517" edc:desc="" edc:mask="0xf" edc:name="PIXEL2517" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2516" edc:desc="" edc:mask="0xf" edc:name="PIXEL2516" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA99C" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA103" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA103" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL2531" edc:desc="" edc:mask="0xf" edc:name="PIXEL2531" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2530" edc:desc="" edc:mask="0xf" edc:name="PIXEL2530" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2529" edc:desc="" edc:mask="0xf" edc:name="PIXEL2529" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2528" edc:desc="" edc:mask="0xf" edc:name="PIXEL2528" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2527" edc:desc="" edc:mask="0xf" edc:name="PIXEL2527" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2526" edc:desc="" edc:mask="0xf" edc:name="PIXEL2526" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2525" edc:desc="" edc:mask="0xf" edc:name="PIXEL2525" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2524" edc:desc="" edc:mask="0xf" edc:name="PIXEL2524" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA9A0" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA104" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA104" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL267" edc:desc="" edc:mask="0xf" edc:name="PIXEL267" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL266" edc:desc="" edc:mask="0xf" edc:name="PIXEL266" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL265" edc:desc="" edc:mask="0xf" edc:name="PIXEL265" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL264" edc:desc="" edc:mask="0xf" edc:name="PIXEL264" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL263" edc:desc="" edc:mask="0xf" edc:name="PIXEL263" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL262" edc:desc="" edc:mask="0xf" edc:name="PIXEL262" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL261" edc:desc="" edc:mask="0xf" edc:name="PIXEL261" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL260" edc:desc="" edc:mask="0xf" edc:name="PIXEL260" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA9A4" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA105" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA105" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL2615" edc:desc="" edc:mask="0xf" edc:name="PIXEL2615" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2614" edc:desc="" edc:mask="0xf" edc:name="PIXEL2614" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2613" edc:desc="" edc:mask="0xf" edc:name="PIXEL2613" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2612" edc:desc="" edc:mask="0xf" edc:name="PIXEL2612" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2611" edc:desc="" edc:mask="0xf" edc:name="PIXEL2611" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2610" edc:desc="" edc:mask="0xf" edc:name="PIXEL2610" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL269" edc:desc="" edc:mask="0xf" edc:name="PIXEL269" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL268" edc:desc="" edc:mask="0xf" edc:name="PIXEL268" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA9A8" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA106" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA106" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL2623" edc:desc="" edc:mask="0xf" edc:name="PIXEL2623" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2622" edc:desc="" edc:mask="0xf" edc:name="PIXEL2622" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2621" edc:desc="" edc:mask="0xf" edc:name="PIXEL2621" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2620" edc:desc="" edc:mask="0xf" edc:name="PIXEL2620" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2619" edc:desc="" edc:mask="0xf" edc:name="PIXEL2619" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2618" edc:desc="" edc:mask="0xf" edc:name="PIXEL2618" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2617" edc:desc="" edc:mask="0xf" edc:name="PIXEL2617" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2616" edc:desc="" edc:mask="0xf" edc:name="PIXEL2616" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA9AC" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA107" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA107" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL2631" edc:desc="" edc:mask="0xf" edc:name="PIXEL2631" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2630" edc:desc="" edc:mask="0xf" edc:name="PIXEL2630" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2629" edc:desc="" edc:mask="0xf" edc:name="PIXEL2629" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2628" edc:desc="" edc:mask="0xf" edc:name="PIXEL2628" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2627" edc:desc="" edc:mask="0xf" edc:name="PIXEL2627" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2626" edc:desc="" edc:mask="0xf" edc:name="PIXEL2626" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2625" edc:desc="" edc:mask="0xf" edc:name="PIXEL2625" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2624" edc:desc="" edc:mask="0xf" edc:name="PIXEL2624" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA9B0" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA108" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA108" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL277" edc:desc="" edc:mask="0xf" edc:name="PIXEL277" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL276" edc:desc="" edc:mask="0xf" edc:name="PIXEL276" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL275" edc:desc="" edc:mask="0xf" edc:name="PIXEL275" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL274" edc:desc="" edc:mask="0xf" edc:name="PIXEL274" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL273" edc:desc="" edc:mask="0xf" edc:name="PIXEL273" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL272" edc:desc="" edc:mask="0xf" edc:name="PIXEL272" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL271" edc:desc="" edc:mask="0xf" edc:name="PIXEL271" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL270" edc:desc="" edc:mask="0xf" edc:name="PIXEL270" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA9B4" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA109" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA109" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL2715" edc:desc="" edc:mask="0xf" edc:name="PIXEL2715" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2714" edc:desc="" edc:mask="0xf" edc:name="PIXEL2714" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2713" edc:desc="" edc:mask="0xf" edc:name="PIXEL2713" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2712" edc:desc="" edc:mask="0xf" edc:name="PIXEL2712" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2711" edc:desc="" edc:mask="0xf" edc:name="PIXEL2711" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2710" edc:desc="" edc:mask="0xf" edc:name="PIXEL2710" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL279" edc:desc="" edc:mask="0xf" edc:name="PIXEL279" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL278" edc:desc="" edc:mask="0xf" edc:name="PIXEL278" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA9B8" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA110" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA110" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL2723" edc:desc="" edc:mask="0xf" edc:name="PIXEL2723" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2722" edc:desc="" edc:mask="0xf" edc:name="PIXEL2722" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2721" edc:desc="" edc:mask="0xf" edc:name="PIXEL2721" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2720" edc:desc="" edc:mask="0xf" edc:name="PIXEL2720" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2719" edc:desc="" edc:mask="0xf" edc:name="PIXEL2719" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2718" edc:desc="" edc:mask="0xf" edc:name="PIXEL2718" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2717" edc:desc="" edc:mask="0xf" edc:name="PIXEL2717" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2716" edc:desc="" edc:mask="0xf" edc:name="PIXEL2716" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA9BC" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA111" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA111" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL2731" edc:desc="" edc:mask="0xf" edc:name="PIXEL2731" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2730" edc:desc="" edc:mask="0xf" edc:name="PIXEL2730" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2729" edc:desc="" edc:mask="0xf" edc:name="PIXEL2729" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2728" edc:desc="" edc:mask="0xf" edc:name="PIXEL2728" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2727" edc:desc="" edc:mask="0xf" edc:name="PIXEL2727" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2726" edc:desc="" edc:mask="0xf" edc:name="PIXEL2726" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2725" edc:desc="" edc:mask="0xf" edc:name="PIXEL2725" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL2724" edc:desc="" edc:mask="0xf" edc:name="PIXEL2724" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8EA9C0" edc:_begin="0xec" edc:_end="0x9f4" edc:_modsrc="DOS-EIP-00160_gfx_gdc_ctlr_v1.Module" edc:_refcount="5" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="GLCDCURDATA112" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="GLCDCURDATA112" edc:nzwidth="32" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="GLCD">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PIXEL287" edc:desc="" edc:mask="0xf" edc:name="PIXEL287" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL286" edc:desc="" edc:mask="0xf" edc:name="PIXEL286" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL285" edc:desc="" edc:mask="0xf" edc:name="PIXEL285" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL284" edc:desc="" edc:mask="0xf" edc:name="PIXEL284" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL283" edc:desc="" edc:mask="0xf" edc:name="PIXEL283" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL282" edc:desc="" edc:mask="0xf" edc:name="PIXEL282" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL281" edc:desc="" edc:mask="0xf" edc:name="PIXEL281" edc:nzwidth="4"/>
            <edc:SFRFieldDef edc:cname="PIXEL280" edc:desc="" edc:mask="0xf" edc:name="PIXEL280" edc:nzwidth="4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
